% Чувствительность к НУ
% a, b и c параметры
% x0 и x1 разные НУ
% t0 и tf начальное и конечное значения времени 
%--------------------------------------------------------------------------
clc; clear;
a = 0.2; b = 0.2; c = 5.7; t0 = 0; tf = 200; h = 0.05;
f = @(t,x) [-x(2)-x(3); x(1)+a*x(2); b+x(3)*(x(1)-c)];
tspan = t0:h:tf;      % интервал для ode45()
%--------------------------------------------------------------------------
x0 = [1; 1; 0];    % НУ 1
[t,x] = ode45(f,tspan,x0);
plot(t,x(:,1),'-b*','MarkerSize',2); hold on
%--------------------------------------------------------------------------
x1 = [1; 1; 0.1];   % НУ 2
[t,x] = ode45(f,tspan,x1); 
plot(t,x(:,1),'-r','LineWidth',1);
hold all;
xlabel('t'); ylabel('x(t)');
legend(sprintf('x(t) с Н.У [%.1f, %.1f, %.1f]',x0),...
    sprintf('x(t) с Н.У [%.1f, %.1f, %.2f]',x1));
title('Чувствительность к Н.У.');